/******************************************************************************

                  版权所有 (C), 2001-2013, 华为技术有限公司

 ******************************************************************************
  文 件 名   : tools_err.h
  版 本 号   : 初稿
  作    者   : lifangxiang/00218420
  生成日期   : 2013年10月31日
  最近修改   :
  功能描述   : 错误代码描述
  函数列表   :
  修改历史   :
  1.日    期   : 2013年10月31日
    作    者   : lifangxiang/00218420
    修改内容   : 创建文件

******************************************************************************/
#ifndef __TOOLS_ERR_H__
#define __TOOLS_ERR_H__

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "tools_err_reg.h"
 
#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*----------------------------------------------*
 * 错误代码结构定义                             *
 *----------------------------------------------*/
/*
模块标示   子模块标示 具体错误代码

|-----------------------|主模块标示(8位)
                        |-----------------------|子模块标示(8位)
                                                |--------------------------------------|具体错误代码(16位)
|32|31|30|29|28|27|26|25|24|23|22|21|20|19|18|17|16|15|14|13|12|11|10|9|8|7|6|5|4|3|2|1|
*/

/*----------------------------------------------*
 * 错误代码模块偏移设置                         *
 *----------------------------------------------*/
#define TOOLS_MOD_MASK 0xFF
#define TOOLS_MOD_SHIFT 24

#define TOOLS_SUB_MOD_MASK 0xFF
#define TOOLS_SUB_MOD_SHIFT 16


/*----------------------------------------------*
 * 生成指定模块的基础错误代码                   *
 *----------------------------------------------*/
#define TOOLS_REG_EBASE(MOD, SUBMOD)\
            ((TOOLS_MOD_MASK & MOD) << TOOLS_MOD_SHIFT | (TOOLS_SUB_MOD_MASK & SUBMOD) << TOOLS_SUB_MOD_SHIFT)


/*----------------------------------------------*
 * 一般性错误代码定义                           *
 *----------------------------------------------*/
enum emECODE_COMMON
{
    ERR_S_OK = 0,
    ERR_E_BASE = TOOLS_REG_EBASE(ERR_MOD_TOOLS, ERR_MOD_TOOLS_COM),
    ERR_E_FAIL,
    ERR_E_NULLINPUT,
    ERR_E_INVALIDINPUT,
    ERR_E_INVALID,
    ERR_E_ENOUGHMEM,
    ERR_E_INIT,
    ERR_E_UNSUPPORTED,
    ERR_E_UNIMPLEMENTED,
};












#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __TOOLS_ERR_H__ */


