/******************************************************************************

                  版权所有 (C), 2001-2013, 华为技术有限公司

 ******************************************************************************
  文 件 名   : tools_err_reg.h
  版 本 号   : 初稿
  作    者   : lifangxiang/00218420
  生成日期   : 2013年11月4日
  最近修改   :
  功能描述   : tools_err_reg.h 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年11月4日
    作    者   : lifangxiang/00218420
    修改内容   : 创建文件

******************************************************************************/
#ifndef __TOOLS_ERR_REG_H__
#define __TOOLS_ERR_REG_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

/*----------------------------------------------*
 * 各模块错误代码定义                           *
 *----------------------------------------------*/

/* tools */
#define ERR_MOD_TOOLS       0           /* tools */
#define ERR_MOD_TOOLS_COM   0           /* tools-common */


/* continue */




#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __TOOLS_ERR_REG_H__ */
